# String operation on data

**NOTE**: All string operation which could be done on _x_ as **str**, like ```x.split(' ')``` now can be done on
text data columns by just adding _str_ after the column name. 
```
df.Name.str.upper()
```

In [1]:
import pandas as pd

In [2]:
data = {
    'Name': ['Jack', 'steven', 'boB', 'jAkE'],
    'Age': [11, 12, 5, 7]
}
df = pd.DataFrame(data)
df

     Name  Age
0    Jack   11
1  steven   12
2     boB    5
3    jAkE    7

In [4]:
# Lets fix names
df.Name = df.Name.str.capitalize()
df

     Name  Age
0    Jack   11
1  Steven   12
2     Bob    5
3    Jake    7

In [9]:
df['numOfCharInName'] = df.Name.str.len()
df

     Name  Age  numOfCharInName
0    Jack   11                4
1  Steven   12                6
2     Bob    5                3
3    Jake    7                4

In [11]:
df.insert(3, 'numberOfE', df.Name.str.count('e'))

In [12]:
df

     Name  Age  numOfCharInName  numberOfE
0    Jack   11                4          0
1  Steven   12                6          2
2     Bob    5                3          0
3    Jake    7                4          1